// less 15

// Домашнее задание:

// Создайте Changelog файл своего проекта на основе своих коммитов в ветке main
// ================================================================

// Упражнения с тернарным оператором в JavaScript:

// 1. Создайте переменную number с любым числом. Напишите выражение, которое проверяет, является ли это число четным или нечетным, и отображает соответствующее сообщение.

// 2. Создайте boolean переменную isLoggedIn (значение выберите сами). Используйте тернарный оператор, чтобы проверить, аутентифицирован ли пользователь, и отобразить соответствующее сообщение.

// 3. Создайте переменную с ценой за единицу товара. Еще одну с количеством товара. И еще одну boolean переменную которая будет отображать наличие данного товара на складе. Рассчитайте полную цену всего доступного на складе товара на основе наличия на складе и отобразите соответствующую цену, если товара в наличии нет, отобразите соответствующее сообщение.

// 4. Проверьте, является ли текущий год високосным, и выведите соответствующее сообщение. (Погуглите как получить текущий год)

// ================================================================

// Упражнения со switch:


// Реализуйте программу, которая преобразует код страны в полное название страны:
// Например, код страны «MD» соответствует CountryName = «Moldova».
// минимум 5 стран.

// Создайте программу, которая присваивает значение на основе оценки, полученной на тесте:
// Например, если балл >= 90, оценки = «A» и т. д. от A до F. Пример значений тут

// ================================================================

